## data type cast

In [4]:
import pandas as pd
import numpy as np
pd.Series([1, 2, np.nan, 1])

0    1.0
1    2.0
2    NaN
3    1.0
dtype: float64

In [5]:
pd.Series(['fd', None, 'k' ])

0      fd
1    None
2       k
dtype: object

In [7]:
pd.Series([True, np.nan, False])

0     True
1      NaN
2    False
dtype: object

## detecting null values

In [8]:
data = pd.Series([1, np.nan, 'hello', None])

In [9]:
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [11]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [12]:
data[data.notnull()] # used as a mask

0        1
2    hello
dtype: object

In [13]:
data.dropna()

0        1
2    hello
dtype: object

In [20]:
df = np.random.randint(0, 12, size = (3, 4))
df = pd.DataFrame(df, columns = list('ABCD'))
df

   A   B  C  D
0  1  10  1  2
1  9   3  2  3
2  1   1  5  8

In [31]:
df.iloc[[1,2], [2, 2]] = None

In [35]:
df.dropna(axis =1) # default is 0 or rows

   A   B  D
0  1  10  2
1  9   3  3
2  1   1  8

In [36]:
df

   A   B    C  D
0  1  10  1.0  2
1  9   3  NaN  3
2  1   1  NaN  8

In [48]:
df.loc[[0, 1], ['C', 'D']] = None

In [49]:
df

   A   B   C    D
0  1  10 NaN  NaN
1  9   3 NaN  NaN
2  1   1 NaN  8.0

In [51]:
df.dropna(axis = 1, how = "all") # only drop the column if all value is NA

   A   B    D
0  1  10  NaN
1  9   3  NaN
2  1   1  8.0

## fill in default values

In [52]:
data = pd.Series([1, None, 2, np.nan, 3])

In [53]:
data

0    1.0
1    NaN
2    2.0
3    NaN
4    3.0
dtype: float64

In [54]:
data.fillna(0)

0    1.0
1    0.0
2    2.0
3    0.0
4    3.0
dtype: float64

In [55]:
data

0    1.0
1    NaN
2    2.0
3    NaN
4    3.0
dtype: float64

In [56]:
data.fillna(method = 'bfill') # fill the previous value

0    1.0
1    2.0
2    2.0
3    3.0
4    3.0
dtype: float64

In [57]:
df

   A   B   C    D
0  1  10 NaN  NaN
1  9   3 NaN  NaN
2  1   1 NaN  8.0

In [59]:
df.fillna(method = 'ffill', axis = 1)

     A     B     C     D
0  1.0  10.0  10.0  10.0
1  9.0   3.0   3.0   3.0
2  1.0   1.0   1.0   8.0